# -*- coding:utf-8 -*-
"""
-------------------------------------------------
Project Name: toolkits
File Name: google_translation_api2.py
Author: gaoyw
Create Date: 2021/3/29
-------------------------------------------------
"""
from googletrans import Translator

"""
支持的语种

LANGUAGES = {
    'af': 'afrikaans',
    'sq': 'albanian',
    'am': 'amharic',
    'ar': 'arabic',
    'hy': 'armenian',
    'az': 'azerbaijani',
    'eu': 'basque',
    'be': 'belarusian',
    'bn': 'bengali',
    'bs': 'bosnian',
    'bg': 'bulgarian',
    'ca': 'catalan',
    'ceb': 'cebuano',
    'ny': 'chichewa',
    'zh-cn': 'chinese (simplified)',
    'zh-tw': 'chinese (traditional)',
    'co': 'corsican',
    'hr': 'croatian',
    'cs': 'czech',
    'da': 'danish',
    'nl': 'dutch',
    'en': 'english',
    'eo': 'esperanto',
    'et': 'estonian',
    'tl': 'filipino',
    'fi': 'finnish',
    'fr': 'french',
    'fy': 'frisian',
    'gl': 'galician',
    'ka': 'georgian',
    'de': 'german',
    'el': 'greek',
    'gu': 'gujarati',
    'ht': 'haitian creole',
    'ha': 'hausa',
    'haw': 'hawaiian',
    'iw': 'hebrew',
    'he': 'hebrew',
    'hi': 'hindi',
    'hmn': 'hmong',
    'hu': 'hungarian',
    'is': 'icelandic',
    'ig': 'igbo',
    'id': 'indonesian',
    'ga': 'irish',
    'it': 'italian',
    'ja': 'japanese',
    'jw': 'javanese',
    'kn': 'kannada',
    'kk': 'kazakh',
    'km': 'khmer',
    'ko': 'korean',
    'ku': 'kurdish (kurmanji)',
    'ky': 'kyrgyz',
    'lo': 'lao',
    'la': 'latin',
    'lv': 'latvian',
    'lt': 'lithuanian',
    'lb': 'luxembourgish',
    'mk': 'macedonian',
    'mg': 'malagasy',
    'ms': 'malay',
    'ml': 'malayalam',
    'mt': 'maltese',
    'mi': 'maori',
    'mr': 'marathi',
    'mn': 'mongolian',
    'my': 'myanmar (burmese)',
    'ne': 'nepali',
    'no': 'norwegian',
    'or': 'odia',
    'ps': 'pashto',
    'fa': 'persian',
    'pl': 'polish',
    'pt': 'portuguese',
    'pa': 'punjabi',
    'ro': 'romanian',
    'ru': 'russian',
    'sm': 'samoan',
    'gd': 'scots gaelic',
    'sr': 'serbian',
    'st': 'sesotho',
    'sn': 'shona',
    'sd': 'sindhi',
    'si': 'sinhala',
    'sk': 'slovak',
    'sl': 'slovenian',
    'so': 'somali',
    'es': 'spanish',
    'su': 'sundanese',
    'sw': 'swahili',
    'sv': 'swedish',
    'tg': 'tajik',
    'ta': 'tamil',
    'te': 'telugu',
    'th': 'thai',
    'tr': 'turkish',
    'uk': 'ukrainian',
    'ur': 'urdu',
    'ug': 'uyghur',
    'uz': 'uzbek',
    'vi': 'vietnamese',
    'cy': 'welsh',
    'xh': 'xhosa',
    'yi': 'yiddish',
    'yo': 'yoruba',
    'zu': 'zulu',
}


"""


# 这个项目经常被谷歌针对，目前是20210329，可使用pip install googletrans==4.0.0-rc1，在win10系统上可运行
def simple_demo():
    translator = Translator()
    result = translator.translate('这是一个测试中文源语言句子.', src="zh-cn", dest="ug")
    print(result)
    result = translator.translate('这是一个测试中文源语言句子.', src="zh-cn", dest="en")
    print(result.text)
    ug_str = "تەھرىرلىگۈچ: تۈنۈگۈن, تۈنۈگۈن, بىراڭچى, بىر نەچچە مۈشۈكئېيىق جىگەر توپا توشقان «Hongcitits كۆك رەڭگىگە چىققان» »نىڭ خەۋەر قىلىنىشىچە, بۇ نەچچە يۈزمىڭلىغان تورنىڭ ئىلگىرلىشى قوزغىغان. بۈگۈن ئەتىگەندە ئوخشاش, بىزنىڭ% 20 enibeens كۆك راۋانلۇق كۆك رەنجىرلىقى مەزمۇنى ۋە% 80 تورمۇز, يەنىمۇ كۆپ ئىشىنىدۇ دەپ قارايدۇ بۇ تېما قانداق مۇناسىۋەتسىز, بالىنى بەك ئامراق, مۇتلەق ئاڭلىماسلىق كېرەك! تۇغۇت بىلەن تارقالغان ھادىسە, كۆپىنچە پىكىردە كىشىلەرنىڭ كۆپىنچىسى ئاتا-ئانىلارنى قوللايدىغان پىكىرلەر, ھالبۇكى توختىتىش توختىتىش پالەك كۆپىنچە بالىلاردىن. «دۇنياڭىز» بولۇپ قالماڭ, مەن ھەرگىز مۇنازىرە قىلماقچى بولىدۇ »... ئىشلەتكۈچى: بەزى قۇرلار دۈشمەن, قارتا, قارتا توققۇز. 2, ئاھ? قاتىللىق! 3, ئىتائەت قىلىشقا قارشى تۇرۇش, ئايالى ئېرىگە ئۇرۇلدى! 4, مەن ئايالىم بولۇشقا ۋەدە بەرسىڭىزلا, مەن سىزگە ئازار بەرمەيمەن! 5, كۆك توشقان, مېنىڭ گۈزەللىكىم, خانىم! گۈزەللىك, ئېرىڭىز كېلىۋاتىدۇ! 6, موماي يۇقىرىدا ئەمەسمۇ? ... بۇ كارتون, بالىڭىزنى كۆرەلەمسىز? «Hongsi» كارتون ئىشلەپچىقارغۇچىلارنى سوراپ بېقىڭ, پۇل تاپماڭ, ئازراق ۋىجدان, بالىلىرىمىزنى تېتىپ بېقىڭ! ماشىنا توختىتىشنى كۈچلۈك قوللاڭ, ھەمىشە تارقىتىڭ! ! ! ... [ئىنچىكى, مەن 7 ياشلىق بالا, مەندە مۇتەئەسسىپ, بالىم ھەسەن-ھۈسەننىڭ كۆك توشقانلىرىنى كۆردى, چۈنكى بالا باشقىلارنىڭ ئالبۇملىقىنى كۆردى, پەرۋەردىگار بولغاندا, مەن بۇ پەقەت جەڭ سەنئەت فىلىمىنىڭ كارتون فىلىمى. بۇ نەرسە بالىلارغا قانداق ماسلىشالايدۇ? كارتون سۇئوننىڭ ئۆسۈشىگە ئىگە بولۇپ, چوڭ بالىنىڭ ئۆزىنىڭ ھۆكۈمى بولىدۇ. كىچىك بالىنىڭ ئىجتىمائىي تەجرىبىسى يوق, بۇنداق ئىشلار بالىغا تەسىر قىلىشمۇ? بەزى باھالار قايتۇرما زەربە بېرىدۇ. سەمىمىي بولۇش ئۈچۈن, مەنمۇ تۆت داڭلىق سەنئەت دەپ قارايمەن, غەرب Ghost غا شەھۋابىللىق دەپ قارايدۇ, سۇنىڭ زوراۋانلىقىدا, سۇنىڭ ياخشىلىرى, ھەققانىيلىق, ھەققانىيلىق, ئۈچ دۆلەت نۇرغۇن بېشەك بۇلۇڭىنى ئۆتكۈزدى. مەن ئوغلۇمنىڭ ھازىر قاراپ باقمىسۇن, ئۇنىڭ تېخىمۇ كۆپ بولۇشىنى ساقلىمايمەن, ئاندىن قاراڭ, مەن ئوغلۇمنىڭ گۈزەل بولۇشىنى ئۈمىد قىلىمەن. مەن دۇنيانىڭ دادىسىغا قانداق قارايمەن? بۇ كارتون ئاللىقاچان توختاپ, ھەربىي سەنسىز فىلىمنىڭ ئومۇمىي كارتون نۇسخىسىدىكى فىلىمنى ئۆلتۈرۈپ, ئۆلتۈرۈلگەن, مۇھەببەت, ئۆزگەرتىش, يېڭى نىيەتكە يېقىنلاشقان. بۇ مەزمۇنلار قۇرامىغا يەتكەن ئۇرۇش سەنئىتى فىلىمى بىلەن ئوخشاش, بۇ بالىدا قىلىدىغان ئىش ئەمەس. نېمىشقا بۇنداق كارتون ئېتىشنىڭ سەۋەبىنى بىلمەيمەن, مەن جەڭ سەنئەت دراممىنى ئېتىشنى خالايمەن, مەن ئۇنى بىۋاسىتە قىلىمەن, بالىڭىزنىڭ ئىدىيىسىنى قىلامسىز? تورداش: كۆك توبابىت فىبباس مۇلايىم مۇلايىم گۈزەللىكىنى, «خوڭكۇن كۆك رەڭلىك نېپىز». ئۆگىنىشكە ئەرزىيدىغىنى, يامغۇرنىڭ مېڭىسى, كۆك توشقان, كۆك توشقاننىڭ مېڭىسى , ساراي كۈچلۈك, ھەتتا مېنىڭ كىچىك تولۇق ئوتتۇرا مەكتەپ ئوقۇغۇچىلىرىممۇ ياخشى تەرەپنى كۆرەلەيدۇ, نېمىشقا ليۇ شۇبۇ? يەنىلا جۇڭگو كارتوننى ياقتۇرمايسىز, بالىلارنى جۇڭگو كارتونغا قارىمىسۇن? قارىغاندا, ھازىر بارلىق كارتون فىلىمنى, «تۇيۇقسىز» يەتتە قەھرىماننىڭ خوجايىنىنىڭ ئىگىسى ھەسەن-ھۈسەندە كۆك توشقاندا, ئەمما ئۈچ پادىشاھلىق رومانتىك سۇدا دېگۈدەك سۇدا دېگۈدەك ئەمەس. ! بولۇپمۇ سۇ ئۆتۈپ كېتىۋاتىدۇ, ئىچى پ جىنئېليان ۋە شى ناھىيە ھەتتا تېخىمۇ سېرىق. ۋۇ ناخشىسى ئۇنى ئىنىسىنى ئويغىغاندا, ئۇنى بېشىنى كېسىپ, تېخىمۇ قورقۇنچ بولالمايدۇ? قانلىق ئەمەسمۇ? بالىلىرىمىزنىڭ ئالدىدا ئىككى قانلىق كىشىلەر ھەسەن-ھۈسەندىكى كۆك توشقاندىكى رەسىمگە قارىغاندا كۆپ ئەمەسمۇ? Racbow كۆك راببىلغا قارشى تۇرسىڭىز, زوراۋانلىق, زوراۋانلىق, مەيلى ئېغىز, لياڭشەننىڭ ئېغىزلىرى بار, لانتىكا ئېغىزى سۇس ئەمەس, شەھۋانىي, تېخىمۇ كۆپ شەپەرەڭ ۋە زوراۋانلىق يوق. نېمىشقا سۇغا قارشى تۇرمايسىز? بۇ نەرسىلەرنى ئالدى بىلەن نېمە? نېمىشقا سۇغا قارشى تۇرمايسىز? چۈنكى ئۇ داڭلىقمۇ? دۇنيانى تونۇش ياخشى. دۇنيا بىلمەيدۇ, سىز مېنى ھەقىقىي سەۋەب, بۇ ھەقىقەت ھەقىقەتەن «ياخشى»! بىزنىڭ ھۆكۈمىمىزگە ئىشەنمىسىڭىز! ئاندىن بىز «ھەسەن-ھۈسەن مۈشۈك كۆك توشقان يەتتە قەھرىمان», ئاتا-ئانىڭىز بىزگە ھەمراھ بولۇشىدىن قورقىدۇ! توغرا نېمە ئىش ئىكەنلىكىنى سۆزلەپ بېرىڭ, نېمە بولدى, ئەمما سىز كېچىدە ئىشلىمەيسىز, ئۇ مايچاڭ ئويناش ناھايىتى قەۋۇل. ھازىر مەن يەنىلا بىزنىڭ بىردىنبىر قىزىقىشىمىزنى مەھرۇم قىلىشىم كېرەك! مېنىڭچە «خوڭكو كۆك توشقان يەتتە» سىزنىڭ ھەرىكىتىڭىزدىنمۇ ئادالەت! سىز پەقەت ئۆزىڭىزنىڭ ھالىدىن خەۋەر ئالىسىز, ھېسسىياتىمىزنى نەزەردىن ساقىت قىلمايمەن! كۆك توشقانلار دوستلارغا ئىشلىتىشكە بولىدۇ! «خوڭكەن كۆك توشقان» پائالىيەتنى ئۆگەنگەن پائالىيەت 108 بۆلۈمدىكى پائالىيەت 108 بۆلۈم بۇ دۆلەتتىكى 800 كىچىكى بولۇپ, ساھابى كىتابلىرىنىڭ سېتىلىش مىقدارى 15 يىلدىن بۇيان 15 مىليونغا يەتتى. قانداقلا بولمىسۇن, ياخشى ئىسىمدا, توربېلغا ئاتلانغان «كونا تۇخۇم» دەپ ئاتالغان تورېبنان «ئېسىل تۇپراق» بانكىسى. 2-ئاينىڭ 26-كۈنى, دۆلەتتىكى مىڭلىغان «ھۇم-ھەسەنە» يۇيۇشتا, «تەپسىلىي] [باھا] [باھا]] ئىبادەتخانا] مۇقاۋىسى» ھۆرمەتلىك كۆك راھىب يەتتە قەھرىماننىڭ گۇناھكارلىقىنى ئېيتىپ بېرىدۇ ناخشىچىنىڭ ناخشىچىسىدىن نارقىراپ نارقىراپ نارقىراپ نارقىراپ نارلاش ناخشىسى نەزەردىن گۇناھقا چۆكۈش گۇناھسىلىنىڭ گۇناھكارلىنىڭ. ئالدىنقى ئەسىرنىڭ 60-يىللىرىدا, قەھرىمان ناخشىچىسى مۇنداق دېدى: لېي فامىلىلىك پاۋلۇس 1963-يىلى 5-مارت, رەئىس ماۋنىڭ يازمىلىرى, «لېي فېڭغا ئۆگىنىش». شۇنىڭدىن كېيىن, لېي فېڭ بىر ئەۋلاد ئىچىدە تەتقىقات ئەندىزىسىگە ئايلاندى. بۈگۈنگە قەدەر, يىل مارت «ئۆگىنىش لېي مۈشۈكى», ياش كەسكۈچىلەرنىڭ قىزىل شارەك كىيگەن بۇ ئىشلار نۇرىنى «تېخنىكا لېي فېڭنىڭ ئىزچىل ھەر خىل ھەرىكەتلەردىكى ئەمەلگە ئاشىدۇ. پاراگوگون دەۋردىكى ئاراللىرىدە بۇتنىڭ مەبۇدىسى. «ئەڭ قورقۇنچلۇق ئىش ھايات, بۇ ھايات پەقەت بىر قېتىملا قارىدى» - بۇ يىل يىل بويى سۆزلەش ئېلىندى, بۇ داڭلىق ياشانغانلار دەرسلىكىدە يېزىلغان. - بۇ داڭلىق شەخسنىڭ باشلامچىلىكىدا بېسىلغان. كىچىك مەكتەپ ئىزدىدى سەھنىگە قويۇلغان. - قوليازمىلار قوليازمىدا ھاياجانلانمىغان. پائۇل بىلەن ئېمىكا شياۋ ئاموپا مۇناسىۋىتى يەنە ياشلارنىڭ ئىنچىكە چۈشۈشىگە ئايلانغان مودا ئايلاندى. ئالدىنقى ئەسىرنىڭ 70-يىللىرىنىڭ روھى بولسا, ئاچ ئاچا-يىل ئاچارچىلىق. ئاچارچىلىق كىشىنى ھەيران قالدۇرىدۇ: چېڭ شياۋمۇن ئالدى ئالدى ». شۇ يىلى «كىشىلەر», «كىشىلەرنىڭ گېزىتى» نىڭ خەۋىرىگە قارىغاندا, «خەلق» گېزىتى »نىڭ« خەلق ئەدەبىي »دىكى« خەلق ئەدەبىيات »قاۋاقخانىسىنى« شۈھنىڭ «خەلق پالاتاسى» دىكى «XU Shi's» دىكى «شۈ فامىيەنىڭ دوكلات تازىلىقى» دا ئەسلىگە كەلتۈردى. بۇ ماقالە تەبىئىي ئىلىم-شىمال ئاياللىرى ئالېماتىكا كەرەپشە قەپەسنىڭ سانى بولۇپ, كىشىنى ھەيران قالدۇرىدىغان بىر قاتار پەردە. گان جاڭرىي دۇنيادىكى ئەڭ يېقىن دۇنيا. كىشىلەر. ئالدىنقى ئەسىرنىڭ 70-يىللىرىنىڭ ئاخىرىدا, 1980-يىللارنىڭ بېشىدىن باشلاپ, دېڭ لىزن شىجۈننىڭ ناخشىسى ئاغدۇرمىچىلىق ئۈنۈمى بىلەن سىمۋول ئىدى. ئۇ تاتلىق ۋە كىچىكلىتىش ناخشىسى, شۇنداق بولغاندا چوڭقۇر ناتاۋۇل بېقىشقا ئىشلىتىدىغان ياشلار يېڭى. دېڭ لىيۈەن دېمۋېن بىردەك تۇرمۇش ئارزۇسىغا ۋەكىللىك قىلىدۇ, شۇڭا ئۇلار يۇندىدىمۇ تېز كەڭپ تاشلىدى. شۈبھىسىزكى, ئۇ يەنە كەڭ دائىرىدە ھۇجۇم قىلدى, ئۇ «qu» othot غا بېغىشاتتى. ئالدىنقى ئەسىرنىڭ 80-يىللىرىدىن باشلاپ, بىر يەككە Bloy-LogoDOneDODODODODODODOD: جۇڭگونىڭ ۋالىي چولپىنى, شياڭگاڭ ۋە تەيۋەندىن كەلگەن تەيۋەن چوللىرى, دۇنيانىڭ ۋالىباي كوماندىسىنىڭ تارىخىدا, دۇنيادىكى ۋىلايىگەر مەركىزىنىڭ تارىخىدا. جۇڭگولۇق ئىجتىمائىي ئالاقە خىتابنامىسى بولۇپ, قويۇق ۋە ئاددىي «ئايال قۇر روھى پۈتۈن ئەۋلاد مەسىلىنى ھەيران قالدى. «ئاياللارنىڭ ۋالىي توپنى ئۆگىنىش, جۇڭگونىڭ« شولى توپنى ئۆگىنىش, ۋەسىي ۋېللىيلېيبول كوماندىسىنى پۈتكۈل جەمئىيەتنىڭ پۈتكۈل جەمئىيىتىنى ئۆگىنىدۇ. «پەسكەشلىك ھۆرمەتلىك پارولى, ئالىيجاناب ئادەمگە ئالىيجاناب, ئەمما ماڭا قارا كۆزلەر بار, ئەمما شائىرنىڭ شائىرلىرىنى ئىزدەيمەن» ... شائىرنىڭ شېئىرلىرى چۆلنىڭ ياۋا ئوتلىرى, ياشلاردا ئوقۇغۇچىلار ئوتتۇرىدا سۈپۈرۈلۈشى. ئۇلار چوڭقۇر ئەكس ئەتتۈرۈش ۋە ئازاب بىلەن ۋارقىراپ, ئۇلارمۇ سانسىز ياشلارغا سەل قارايدۇ. ئالدىنقى نۆۋەتچى ئايروپىلاننىڭ مەدەنىيەت سىمۋولى بەلگىسى: لو كۇبادۇ, جوۋ XeHi ھەققىدە ... 1990-يىللار لوڭ مەركىزى دەۋرى, «شو شوخونىڭ ھېكايىسى», «لاتىن شەھىرىنىڭ ھېكايىسى», «ئەترىتىنىڭ ھېكايىسى», «ئەترەت شەھەرنىڭ ھېكايىسى», «مەن:« پەلەي ». قارا تەنلىكلەر «ئۇنىۋېرسىتېت مەكتەپ رايونىدا قولۇمنى ئەۋەتتىم». لوجى كۇنىڭ ناخشىسى ھايات مەنىسى, ئۇنىڭ غەزىپىنى ئۆز ھاياتىدىن تاپقان ۋە چوڭقۇر ھېس قىلىدىغانلىقىنى ھېس قىلىدۇ. ئۇ پۈتۈن ئەۋلادلارنىڭ كاللىسىدىكى ياشلار بەلگىسى بولۇپ قالدى. 1997-يىلى «غەربكە سەپەر» بولغاندا, بۇ سوغۇق ئىدى. ھېچكىم قالايمىقانچىلىقنىڭ يىپ ئۇچىنى چۈشىنەلمەيدۇ ,دىن ئارتۇق ۋە ئىپادىلەنمەيدۇ. ئۇمۇ چوڭ قۇرۇقلۇقتا «ئالدىنقى قاتاردىكى ئون چوڭ تونۇشتۇرۇش» نىڭ بىرى بولۇش سۈپىتى بىلەن. 2000-يىلى, بۇ فىلىمنى دۆلەتنىڭ دۆلەت گۇرۇھىنى بىر تەرەپ قىلىپ بىر نەچچە يىل تېزلا قويدى. ئالىي مەكتەپ ئوقۇغۇچىلىرى بىر-بىرىنى سورىغانلىقىنى, «غەربكە سەپەر» نىڭ قانچىلىك «غەرب يەن» نى ئىشلىتىپ, «سەن تاڭ يەن! مەن سېنى نۇرىغا قارشى تۇردۇم!» دەپ سورىدى. ھېسسىيات. «مېنىڭ ئالدىدا ئېلىشى». «دەۋرى جۇ» «بۇتلىق» تىن كېيىن, «غەربكە ساياھەت» دەپ ئاتالغان «ئاڭلاشلىق جاپالىق, ئامبۇلاتورىيەلىكلەر قىزىقارلىق. خۇلاسە: مۇنازىرە داۋاملاشماقتا, بىر كىشى بالىنىڭ بالىلىرىدىن ئەنسىرىدى, بىر »« بالىياتقۇ بويسۇنۇشىدا مۇھەببەت »مۇ?"
    result = translator.translate(ug_str, src="ug", dest="zh-cn")
    print(result.text)


if __name__ == '__main__':
    simple_demo()
